Corentin-proj/FOC_stepper/TM4C123GXL/tivaware/sensorlib/hw_mpu6050.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_GYRO_ZOUT_H
// register.
//
//*****************************************************************************
#define MPU6050_GYRO_ZOUT_H_M   0xFF        // Bits [15:8] of Z-axis gyro data
#define MPU6050_GYRO_ZOUT_H_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_GYRO_ZOUT_L
// register.
//
//*****************************************************************************
#define MPU6050_GYRO_ZOUT_L_M   0xFF        // Bits [7:0] of Z-axis gyro data
#define MPU6050_GYRO_ZOUT_L_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_00 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_00_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_00_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_01 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_01_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_01_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_02 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_02_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_02_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_03 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_03_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_03_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_04 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_04_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_04_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_05 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_05_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_05_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_06 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_06_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_06_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_07 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_07_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_07_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_08 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_08_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_08_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_09 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_09_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_09_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_10 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_10_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_10_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_11 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_11_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_11_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_12 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_12_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_12_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_13 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_13_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_13_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_14 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_14_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_14_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_15 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_15_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_15_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_16 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_16_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_16_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_17 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_17_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_17_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_18 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_18_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_18_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_19 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_19_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_19_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_20 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_20_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_20_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_21 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_21_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_21_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_22 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_22_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_22_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_EXT_SENS_DATA_23 register.
//
//*****************************************************************************
#define MPU6050_EXT_SENS_DATA_23_M                                            \
                                0xFF        // External sensor data
#define MPU6050_EXT_SENS_DATA_23_S                                            \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV0_DO
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV0_DO_M   0xFF        // Output data
#define MPU6050_I2C_SLV0_DO_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV1_DO
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV1_DO_M   0xFF        // Output data
#define MPU6050_I2C_SLV1_DO_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV2_DO
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV2_DO_M   0xFF        // Output data
#define MPU6050_I2C_SLV2_DO_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_I2C_SLV3_DO
// register.
//
//*****************************************************************************
#define MPU6050_I2C_SLV3_DO_M   0xFF        // Output data
#define MPU6050_I2C_SLV3_DO_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_I2C_MST_DELAY_CTRL register.
//
//*****************************************************************************
#define MPU6050_I2C_MST_DELAY_CTRL_DELAY_ES_SHADOW                            \
                                0x80        // Delay external sensor data
#define MPU6050_I2C_MST_DELAY_CTRL_I2C_SLV4_DLY_EN                            \
                                0x10        // I2C slave 4 delay enable
#define MPU6050_I2C_MST_DELAY_CTRL_I2C_SLV3_DLY_EN                            \
                                0x08        // I2C slave 3 delay enable
#define MPU6050_I2C_MST_DELAY_CTRL_I2C_SLV2_DLY_EN                            \
                                0x04        // I2C slave 2 delay enable
#define MPU6050_I2C_MST_DELAY_CTRL_I2C_SLV1_DLY_EN                            \
                                0x02        // I2C slave 1 delay enable
#define MPU6050_I2C_MST_DELAY_CTRL_I2C_SLV0_DLY_EN                            \
                                0x01        // I2C slave 0 delay enable

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_SIGNAL_PATH_RESET register.
//
//*****************************************************************************
#define MPU6050_SIGNAL_PATH_RESET_GYRO                                        \
                                0x04        // Reset gyro
#define MPU6050_SIGNAL_PATH_RESET_ACCEL                                       \
                                0x02        // Reset accelerometer
#define MPU6050_SIGNAL_PATH_RESET_TEMP                                        \
                                0x01        // Reset temperature sensor

//*****************************************************************************
//
// The following are defines for the bit fields in the
// MPU6050_O_MOT_DETECT_CTRL register.
//
//*****************************************************************************
#define MPU6050_MOT_DETECT_CTRL_ACCEL_ON_DELAY_M                              \
                                0x30        // Accelerometer wake-up delay
#define MPU6050_MOT_DETECT_CTRL_ACCEL_ON_DELAY_4MS                            \
                                0x00        // Delay 4 ms
#define MPU6050_MOT_DETECT_CTRL_ACCEL_ON_DELAY_5MS                            \
                                0x10        // Delay 5 ms
#define MPU6050_MOT_DETECT_CTRL_ACCEL_ON_DELAY_6MS                            \
                                0x20        // Delay 6 ms
#define MPU6050_MOT_DETECT_CTRL_ACCEL_ON_DELAY_7MS                            \
                                0x30        // Delay 7 ms
#define MPU6050_MOT_DETECT_CTRL_ACCEL_ON_DELAY_S                              \
                                4

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_USER_CTRL
// register.
//
//*****************************************************************************
#define MPU6050_USER_CTRL_FIFO_EN                                             \
                                0x40        // FIFO enable
#define MPU6050_USER_CTRL_I2C_MST_EN                                          \
                                0x20        // I2C master mode enable
#define MPU6050_USER_CTRL_I2C_IF_DIS                                          \
                                0x10        // Write as zero
#define MPU6050_USER_CTRL_FIFO_RESET                                          \
                                0x04        // Reset FIFO buffer
#define MPU6050_USER_CTRL_I2C_MST_RESET                                       \
                                0x02        // Reset I2C master
#define MPU6050_USER_CTRL_SIG_COND_RESET                                      \
                                0x01        // Reset all sensors

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_PWR_MGMT_1
// register.
//
//*****************************************************************************
#define MPU6050_PWR_MGMT_1_DEVICE_RESET                                       \
                                0x80        // Device reset
#define MPU6050_PWR_MGMT_1_SLEEP                                              \
                                0x40        // Enter sleep mode
#define MPU6050_PWR_MGMT_1_CYCLE                                              \
                                0x20        // Enable automatic sleep
#define MPU6050_PWR_MGMT_1_TEMP_DIS                                           \
                                0x08        // Disable temperature sensor
#define MPU6050_PWR_MGMT_1_CLKSEL_M                                           \
                                0x07        // Clock source select
#define MPU6050_PWR_MGMT_1_CLKSEL_INT                                         \
                                0x00        // Internal 8 MHz oscillator
#define MPU6050_PWR_MGMT_1_CLKSEL_XG                                          \
                                0x01        // PLL with X-axis gyro reference
#define MPU6050_PWR_MGMT_1_CLKSEL_YG                                          \
                                0x02        // PLL with Y-axis gyro reference
#define MPU6050_PWR_MGMT_1_CLKSEL_ZG                                          \
                                0x03        // PLL with Z-axis gyro reference
#define MPU6050_PWR_MGMT_1_CLKSEL_EXT32K                                      \
                                0x04        // PLL with external 32.768 kHz
                                            // reference
#define MPU6050_PWR_MGMT_1_CLKSEL_EXT19M                                      \
                                0x05        // PLL with external 19.2 MHz
                                            // reference
#define MPU6050_PWR_MGMT_1_CLKSEL_STOP                                        \
                                0x07        // Clock disable
#define MPU6050_PWR_MGMT_1_CLKSEL_S                                           \
                                0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_PWR_MGMT_2
// register.
//
//*****************************************************************************
#define MPU6050_PWR_MGMT_2_LP_WAKE_CTRL_M                                     \
                                0xC0        // Wake-up frequency
#define MPU6050_PWR_MGMT_2_LP_WAKE_CTRL_1_25                                  \
                                0x00        // Wake-up at 1.25 Hz
#define MPU6050_PWR_MGMT_2_LP_WAKE_CTRL_5                                     \
                                0x40        // Wake-up at 5 Hz
#define MPU6050_PWR_MGMT_2_LP_WAKE_CTRL_20                                    \
                                0x80        // Wake-up at 20 Hz
#define MPU6050_PWR_MGMT_2_LP_WAKE_CTRL_40                                    \
                                0xC0        // Wake-up at 40 Hz
#define MPU6050_PWR_MGMT_2_STBY_XA                                            \
                                0x20        // Put X-axis accelerometer into
                                            // standby mode
#define MPU6050_PWR_MGMT_2_STBY_YA                                            \
                                0x10        // Put Y-axis accelerometer into
                                            // standby mode
#define MPU6050_PWR_MGMT_2_STBY_ZA                                            \
                                0x08        // Put Z-axis accelerometer into
                                            // standby mode
#define MPU6050_PWR_MGMT_2_STBY_XG                                            \
                                0x04        // Put X-axis gyro into standby
                                            // mode
#define MPU6050_PWR_MGMT_2_STBY_YG                                            \
                                0x02        // Put Y-axis gyro into standby
                                            // mode
#define MPU6050_PWR_MGMT_2_STBY_ZG                                            \
                                0x01        // Put Z-axis gyro into standby
                                            // mode
#define MPU6050_PWR_MGMT_2_LP_WAKE_CTRL_S                                     \
                                6

